Res-firecracker-random-v7/firecracker_t_4_c_6_frontVcpu_8_wrkVcpu_2/wrk.txt
Running 1m test @ http://frontend:5000
  4 threads and 6 connections
  Thread calibration: mean lat.: 5167.631ms, rate sampling interval: 17989ms
  Thread calibration: mean lat.: 4135.302ms, rate sampling interval: 15499ms
  Thread calibration: mean lat.: 5152.567ms, rate sampling interval: 18006ms
  Thread calibration: mean lat.: 5094.239ms, rate sampling interval: 18071ms
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency    23.30s     7.18s   33.19s    56.29%
    Req/Sec   285.00      2.21   288.00     88.89%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   26.05s 
 75.000%   29.93s 
 90.000%   31.65s 
 99.000%   33.19s 
 99.900%   33.75s 
 99.990%   33.91s 
 99.999%   33.95s 
100.000%   33.95s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

    8708.095     0.000000            2         1.00
   14000.127     0.100000         5723         1.11
   15319.039     0.200000        11429         1.25
   17137.663     0.300000        17115         1.43
   19759.103     0.400000        22808         1.67
   26050.559     0.500000        28515         2.00
   27148.287     0.550000        31432         2.22
   27770.879     0.600000        34234         2.50
   28671.999     0.650000        37083         2.86
   29442.047     0.700000        39927         3.33
   29933.567     0.750000        42768         4.00
   30146.559     0.775000        44275         4.44
   30375.935     0.800000        45687         5.00
   30638.079     0.825000        47076         5.71
   30949.375     0.850000        48489         6.67
   31260.671     0.875000        49886         8.00
   31457.279     0.887500        50613         8.89
   31653.887     0.900000        51340        10.00
   31834.111     0.912500        52092        11.43
   32014.335     0.925000        52784        13.33
   32178.175     0.937500        53509        16.00
   32243.711     0.943750        53806        17.78
   32325.631     0.950000        54210        20.00
   32423.935     0.956250        54551        22.86
   32555.007     0.962500        54918        26.67
   32669.695     0.968750        55232        32.00
   32751.615     0.971875        55433        35.56
   32833.535     0.975000        55630        40.00
   32899.071     0.978125        55777        45.71
   32964.607     0.981250        55943        53.33
   33046.527     0.984375        56148        64.00
   33079.295     0.985938        56214        71.11
   33128.447     0.987500        56312        80.00
   33177.599     0.989062        56408        91.43
   33226.751     0.990625        56488       106.67
   33292.287     0.992188        56579       128.00
   33325.055     0.992969        56619       142.22
   33374.207     0.993750        56665       160.00
   33406.975     0.994531        56698       182.86
   33456.127     0.995313        56757       213.33
   33488.895     0.996094        56789       256.00
   33521.663     0.996484        56828       284.44
   33538.047     0.996875        56846       320.00
   33554.431     0.997266        56858       365.71
   33587.199     0.997656        56883       426.67
   33619.967     0.998047        56903       512.00
   33652.735     0.998242        56919       568.89
   33652.735     0.998437        56919       640.00
   33685.503     0.998633        56936       731.43
   33718.271     0.998828        56946       853.33
   33751.039     0.999023        56954      1024.00
   33783.807     0.999121        56964      1137.78
   33783.807     0.999219        56964      1280.00
   33816.575     0.999316        56972      1462.86
   33849.343     0.999414        56985      1706.67
   33849.343     0.999512        56985      2048.00
   33849.343     0.999561        56985      2275.56
   33882.111     0.999609        56999      2560.00
   33882.111     0.999658        56999      2925.71
   33882.111     0.999707        56999      3413.33
   33882.111     0.999756        56999      4096.00
   33882.111     0.999780        56999      4551.11
   33882.111     0.999805        56999      5120.00
   33882.111     0.999829        56999      5851.43
   33914.879     0.999854        57006      6826.67
   33914.879     0.999878        57006      8192.00
   33914.879     0.999890        57006      9102.22
   33914.879     0.999902        57006     10240.00
   33914.879     0.999915        57006     11702.86
   33914.879     0.999927        57006     13653.33
   33914.879     0.999939        57006     16384.00
   33914.879     0.999945        57006     18204.44
   33914.879     0.999951        57006     20480.00
   33914.879     0.999957        57006     23405.71
   33914.879     0.999963        57006     27306.67
   33947.647     0.999969        57008     32768.00
   33947.647     1.000000        57008          inf
#[Mean    =    23302.486, StdDeviation   =     7175.484]
#[Max     =    33914.880, Total count    =        57008]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  67763 requests in 1.00m, 28.06MB read
Requests/sec:   1129.38
Transfer/sec:    478.86KB